Revit 2026 API

# RenderingSettingsSetBackgroundSettings Method

---

Changes the rendering background settings details for the current background style.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetBackgroundSettings(
	BackgroundSettings background
)
```
```vb
Public Sub SetBackgroundSettings (
	background As BackgroundSettings
)
```
```cpp
public:
void SetBackgroundSettings(
	BackgroundSettings^ background
)
```
```fsharp
member SetBackgroundSettings :
        background : BackgroundSettings -> unit
```

#### Parameters

background BackgroundSettings
     An instance of the new rendering background settings.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RenderingSettings Class

Autodesk.Revit.DB Namespace